app/controllers/blogs_controller.rb

  def index
    @blog = Blog.all
---
SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" DESC

  def create
    @blog = Blog.new(blog_params)
    if params[:back]
      render :new
    else
      if @blog.save
---
INSERT INTO "blogs" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "Yes"], ["created_at", "2019-09-19 09:21:40.165114"], ["updated_at", "2019-09-19 09:21:40.165114"]]

  def update
    @blog = set_blog
    if @blog.update(blog_params)
---
UPDATE "blogs" SET "content" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["content", "asxaxaxaxsarfrfrfrfrfrfrfrf"], ["updated_at", "2019-09-20 04:21:39.576634"], ["id", 31]]

  def destroy
    @blog = set_blog.destroy
---
DELETE FROM "blogs" WHERE "blogs"."id" = $1  [["id", 14]]

  def set_blog
    Blog.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]